Revit 2027 API
ClosestPointsPairBetweenTwoCurves.ParameterOnFirstCurve Property
 1d raw (not normalized) parameter of the point on the first curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ParameterOnFirstCurve { get; set; }
Public Property ParameterOnFirstCurve As Double
	Get
	Set
public:
property double ParameterOnFirstCurve {
	double get ();
	void set (double value);
}
member ParameterOnFirstCurve : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The property has not been set by the method providing the result.
See Also
Reference
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace